<?php
/**
* @comment ส่งออกไฟล์ doc
* @projectCode 58PTY01
* @tor 3.1.4
* @package core
* @author Kiatisak  Chansawang
* @access public/private
* @created 31/05/2016
*/
# ตัวอย่างไฟล์การส่งออก ms word + จัด format file เข้ารหัสไฟล์แบบ utf-8
# รูปแบบ พรีวิวก่อนทำการกดส่งออก
header('Content-Type: text/html; charset=utf-8');
include('define_config_db.php');
?>
<html>
<head>
<!-- ไม่ต้องระบุ charset -->
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/bootstrap3.min.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/table_style.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/font_style.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/AllFont.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/page_loading.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/sweetalert.css" />
<link rel="stylesheet" type="text/css" href="http://<?php echo $_SERVER['SERVER_NAME']?>/html2doc/common/global/css/main.css" />
<!-- ไม่ต้องระบุ charset -->
</head>
<script type="application/javascript" src="common/global/js/jquery-1.10.2.js"></script>
<script>
$(document).ready(function(){
	$('#export').click(function(){
		var bodyContent = $('#exportData').html();
		$.ajax({
			method: "POST",
			url: "html2doc_setContent.php",
			data: {htmlBody: bodyContent, exportData : 'on', apptype : 'text/plain', filetype : 'txt'}
		}) .done(function( msg ) {
			if($.trim(msg) == 'ok'){
				window.open('html2txt.php','_blank');
			}
		});
	});
});
</script>
<style>
	@page Section1 {
		size: 8.5in 11.0in;
		margin: 1.0in 1.25in 1.0in 1.25in ;
		mso-header-margin: .5in;
		mso-footer-margin: .5in;
		mso-paper-source: 0;
	}

	#exportData {
		float:left;
		width:auto;
		height:auto;
	}
</style>
<body>
<input type="button" id="export" value="ส่งออก">
<div id="exportData">
"2"	"3140100271697"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2554-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/16/2016 08:49:54"
"3"	"3240500400400"	"1"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2548-12-05"	""	""	""	""	""	""	""	"1"	""	""	" "	"บ.ช."	"11/17/2016 11:34:03"
"4"	"3240500400400"	"2"	"จัตุรถาภรณ์มงกุฎไทย"	"28"	"2553-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"จ.ม."	"11/17/2016 11:34:53"
"5"	"3249800068824"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2549-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/17/2016 14:20:05"
"6"	"4674165053373"	"0"	"ทวีติยาภรณ์มงกุฎไทย"	"26"	"2558-12-05"	""	"2398"	"6/1"	"13"	"14ข"	"178"	"2559-05-30"	"1"	""	""	""	"ท.ม."	"11/18/2016 12:03:10"
"7"	"3240200103353"	"0"	"ทวีติยาภรณ์ช้างเผือก"	"18"	"2558-12-05"	""	"245"	"6/1"	"133"	"14ข"	"81"	"2559-05-30"	"1"	""	""	""	"ท.ช."	"11/18/2016 12:21:08"
"14"	"3149900331145"	"4"	"จัตุรถาภรณ์ช้างเผือก"	"20"	"2549-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"จ.ช."	"11/19/2016 15:56:01"
"15"	"3149900331145"	"3"	"จัตุรถาภรณ์มงกุฎไทย"	"28"	"2544-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"จ.ม."	"11/19/2016 15:56:01"
"16"	"3149900331145"	"2"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2540-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"11/19/2016 15:56:01"
"17"	"3149900331145"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2538-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 15:56:01"
"20"	"3149900337828"	"3"	"จัตุรถาภรณ์มงกุฎไทย"	"28"	"2551-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"จ.ม."	"11/19/2016 16:03:38"
"21"	"3149900337828"	"2"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2546-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"11/19/2016 16:03:08"
"22"	"3149900337828"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2541-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:03:38"
"23"	"3100201407161"	"3"	"จัตุรถาภรณ์มงกุฎไทย"	"28"	"2552-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"จ.ม."	"11/19/2016 16:05:30"
"24"	"3100201407161"	"2"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2547-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"11/19/2016 16:05:00"
"25"	"3100201407161"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2545-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"12/7/2016 12:03:01"
"26"	"3101203068054"	"2"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2550-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"11/19/2016 16:11:25"
"27"	"3101203068054"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2545-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:11:25"
"28"	"3149900331153"	"2"	"เบญจมาภรณ์ช้างเผือก"	"21"	"2550-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ช."	"11/19/2016 16:13:52"
"29"	"3149900331153"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2545-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:13:52"
"30"	"3450300353988"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2553-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:16:45"
"31"	"3301800336634"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2552-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:17:26"
"32"	"3101400953361"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2550-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:18:37"
"33"	"3149900216664"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2549-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:20:00"
"34"	"3140500178244"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2549-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:22:22"
"35"	"3102401205288"	"1"	"เบญจมาภรณ์มงกุฎไทย"	"29"	"2549-12-05"	""	""	""	""	""	""	""	"1"	""	""	""	"บ.ม."	"11/19/2016 16:23:18"
"38"	"3140100549792"	"0"	"ทวีติยาภรณ์ช้างเผือก"	"18"	"2559-12-05"	""	"1"	"1"	"2"	"3"	"3"	"2559-12-05"	"1"	""	""	""	"ท.ช."	"11/23/2016 11:11:55"
"43"	"3140100549792"	"1"	"ประถมาภรณ์มงกุฎไทย"	"25"	"2559-12-05"	""	"1"	"2"	"2"	"2"	"2"	"2559-12-05"	"1"	""	""	""	"ป.ม."	"11/21/2016 22:56:45"
"44"	"3149900216664"	"2"	"ตริตาภรณ์ช้างเผือก"	"19"	"2559-12-05"	""	"7"	"4"	""	"5"	"8"	"2559-12-05"	"1"	""	""	""	"ต.ช."	"11/22/2016 15:08:13"
"45"	"1200500057148"	"0"	"ทวีติยาภรณ์ช้างเผือก"	"18"	"2559-12-05"	""	"2"	"1"	"1"	"3"	"3"	"2559-12-05"	"1"	""	""	""	"ท.ช."	"11/23/2016 01:39:41"
"47"	"1199600123044"	"0"	"จัตุรถาภรณ์มงกุฎไทย"	"28"	"2558-12-05"	""	"1"	"1"	"1"	"2"	"3"	"2558-12-05"	"1"	""	""	""	"จ.ม."	"11/23/2016 14:15:48"
"60"	"3149900268621"	"1"	""	"0"	""	""	""	""	""	""	""	""	"1"	""	""	""	""	"11/28/2016 11:05:01"
"64"	"3240500400400"	"3"	"จัตุรถาภรณ์ช้างเผือก"	"20"	"2559-12-05"	""	"4"	"1"	""	"2"	"3"	"2560-01-12"	"1"	""	""	""	"จ.ช."	"11/28/2016 14:05:57"
</div>
</body>
</html>
